УТ_для_edt/src/InformationRegisters/смартВходящиеСобытияВзаимодействий/смартВходящиеСобытияВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВходящиеСобытияВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КемОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КогдаОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Партнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидСобытия</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>EnumRef.смартВидыСобытийВзаимодействий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыСобытийВзаимодействий/смартВидыСобытийВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыСобытийВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <enumValues>
    <name>ВходящийТелефонныйЗвонок</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  </enumValues>
  <enumValues>
    <name>СозданиеДокументаИнтерес</name>
    <comment>#1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.</comment>
  </enumValues>
  <enumValues>
    <name>НайденСуществующийПартнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартВходящиеСобытияВзаимодействий/Forms/ФормаСобытияСозданиеДокументаИнтерес/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭтотОбъект.Параметры.НаборДанных.Количество() = 0 Тогда
		
		Отказ = Истина;
		Возврат;  
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.Параметры.НаборДанных[0].Данные);					
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	
	Элементы.ГруппаНовыйЗвонок.Видимость = 
		ЭтотОбъект.Параметры.ВидСобытия = Перечисления.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер;
		
	Элементы.ГруппаНовыйИнтерес.Видимость = Не Элементы.ГруппаНовыйЗвонок.Видимость; 	
	//-- #1789 смарт: Ермаков 22.04.2024
	
	Если Элементы.ГруппаНовыйИнтерес.Видимость Тогда
	
		//++ #1760 смарт: Фролов 18.04.2024 // Создание механизма оповещений менеджеров о назначенных Интересах.
		Если ЗначениеЗаполнено(Документ.ДокументОснование) Тогда
			
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.смартЛид") ИЛИ
				ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.CRM_Заявка") Тогда
				
				ПисьмоИлиЗвонок = Документ.ДокументОснование.ДокументОснование;
				
				Если ТипЗнч(ПисьмоИлиЗвонок) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
					
					Если ПисьмоИлиЗвонок.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
						
						HTMLТекст = "<!DOCTYPE html>
						|<html lang=""ru"">
						|<head>
						|
						|</head>
						|<body>" + ПисьмоИлиЗвонок.ТекстHTML + "</body>
						|</html>";
						
						ПотребностьHTML = HTMLТекст;
						Элементы.Потребность.Видимость = Ложь;
						Элементы.ПотребностьHTML.Видимость = Истина;
						
					Иначе
						
						Элементы.Потребность.Видимость = Истина;
						Элементы.ПотребностьHTML.Видимость = Ложь;
						
					КонецЕсли;
					
				Иначе
					
					Элементы.Потребность.Видимость = Истина;
					Элементы.ПотребностьHTML.Видимость = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//-- #1760 смарт: Фролов 18.04.2024
		
		Элементы.Канал.Видимость = ЗначениеЗаполнено(Партнер);
		
		Если ЭтотОбъект.КоличествоДокументов > 0 Тогда
			
			Элементы.ВниманиеНеразобранныеИнтересы.Заголовок = 
				"Внимание! У вас " 
				+ Строка(ЭтотОбъект.КоличествоДокументов) 
				+ " интереса в статусе " 
				+ Символ(34) + "Неразобранное" + Символ(34);
				
			//++ #1760 смарт: Саломадин 12.04.2024 / Изменение видимости декорации	
			Элементы.ВыдачаИнтересов.Видимость = Истина;	
	        //-- #1760 смарт: Саломадин 12.04.2024 	
			
		КонецЕсли; 
		
	КонецЕсли;
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	
	Если Элементы.ГруппаНовыйЗвонок.Видимость Тогда
		
		Элементы.Переместить(Элементы.Партнер, Элементы.ГруппаНовыйЗвонок);
		Элементы.ВамНазначенНовыйИнтерес.Заголовок = "Входящий звонок !";
		
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеГиперссылки(Элемент, СтандартнаяОбработка)
	
	//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьЗначение(ЭтаФорма[Элемент.Имя]);
	Закрыть();
	//-- #1789 смарт: Ермаков 22.04.2024
	
КонецПроцедуры

#КонецОбласти
